app/Controllers/Admin/Usuarios.php

SELECT *
FROM `usuarios`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
---
    public function index()
    {


        $data = [

            'titulo' => 'Listando os usuarios',
            'usuarios' => $this->usuarioModel->withDeleted(true)->paginate(5),

SELECT *
FROM `usuarios`
WHERE `id` = 5
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1
---
    private function buscaUsuarioOu404(int $id = null)
    {

        if (!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()) {

UPDATE `usuarios` SET `id` = '1', `atualizado_em` = '2023-05-10 16:20:41', `password_hash` = '$2y$10$FNTNmgso6Phu0BjvjUHj..TCL4RAtgeoL.03vMjOQIfaKSMyVtVO2'
WHERE `usuarios`.`id` IN ('1')
---
    public function atualizar($id = null)
    {

        if ($this->request->getMethod() === 'post') {

            $usuario = $this->buscaUsuarioOu404($id);

            if ($usuario->deletado_em != null){

                return redirect()->back()->with('info','O usuário ' .$usuario->nome. ' encontra-se excluído. Não é possível atualiza-lo!');

            }

            $post = $this->request->getPost();


            if (empty($post['password'])) {
                $this->usuarioModel->desabilitaValidacaoSenha();
                unset($post['password']);
                unset($post['password_confirmation']);
            }

            $usuario->fill($post);

            if (!$usuario->hasChanged()) {

                return redirect()->back()->with('atencao', 'Não Há dados para atualizar');
            }


            if ($this->usuarioModel->protect(false)->save($usuario)) {